

import 'package:holly_quran/features/hadith/data/models/hadith_model.dart';

List<HadithModel> hadithList = [
  HadithModel(
    id: 1,
    content: 'عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه) رواه البخاري ومسلم',
  ),
  HadithModel(
    id: 2,
    content: 'عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من صلى علي صلاة واحدة صلى الله عليه عشراً) رواه مسلم',
  ),
  HadithModel(
    id: 3,
    content: 'عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من كذب علي متعمداً فليتبوأ مقعده من النار) رواه البخاري ومسلم',
  ),
  HadithModel(
      id: 4,
      content: 'عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (كل أمتي يدخلون الجنة إلا من أبى) قالوا: يا رسول الله: ومن يأبى؟ قال: (من أطاعني دخل الجنة، ومن عصاني فقد أبى) رواه البخاري'),
  HadithModel(
      id: 5,
      content: 'عن أنس بن مالك الأنصاري رضي الله عنه أن النبي صلى الله عليه وسلم قال: (من رغب عن سنتي فليس مني) رواه البخاري ومسلم'),
  HadithModel(
      id: 6,
      content: 'عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: (لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين) رواه البخاري ومسلم'),
  HadithModel(
      id: 7,
      content: 'عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (قال الله تعالى: أنا أغنى الشركاء عن الشرك من عمل عملاً أشرك فيه معي غيري تركته وشركه) رواه مسلم'),
  HadithModel(
      id: 8,
      content: 'عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان) رواه مسلم'),
  HadithModel(
      id: 9,
      content: 'عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان) رواه البخاري ومسلم'),
  HadithModel(
      id: 10,
      content: 'عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة) رواه البخاري ومسلم'),
  //HadithModel(id: 4, content: ''),
];
